hoang-phuong/stm32l4-env/drivers/stm32l4/inc/reg_rcc.h
#ifndef _REG_RCC_H_
#define _REG_RCC_H_

#include "Std_Types.h"
#include "reg_functions.h"

#define RCC_CR                          REGISTER(0x40021000UL)
#define RCC_CR_MSION_POS                0UL
#define RCC_CR_MSION_LEN                1UL
#define RCC_CR_MSIRDY_POS               1UL
#define RCC_CR_MSIRDY_LEN               1UL
#define RCC_CR_MSIPLLEN_POS             2UL
#define RCC_CR_MSIPLLEN_LEN             1UL
#define RCC_CR_MSIRGSEL_POS             3UL
#define RCC_CR_MSIRGSEL_LEN             1UL
#define RCC_CR_MSIRANGE_POS             4UL
#define RCC_CR_MSIRANGE_LEN             4UL
#define RCC_CR_HSION_POS                8UL
#define RCC_CR_HSION_LEN                1UL
#define RCC_CR_HSIKERON_POS             9UL
#define RCC_CR_HSIKERON_LEN             1UL
#define RCC_CR_HSIRDY_POS               10UL
#define RCC_CR_HSIRDY_LEN               1UL
#define RCC_CR_HSIASFS_POS              11UL
#define RCC_CR_HSIASFS_LEN              1UL
#define RCC_CR_HSEON_POS                16UL
#define RCC_CR_HSEON_LEN                1UL
#define RCC_CR_HSERDY_POS               17UL
#define RCC_CR_HSERDY_LEN               1UL
#define RCC_CR_HSEBYP_POS               18UL
#define RCC_CR_HSEBYP_LEN               1UL
#define RCC_CR_CSSON_POS                19UL
#define RCC_CR_CSSON_LEN                1UL
#define RCC_CR_PLLON_POS                24UL
#define RCC_CR_PLLON_LEN                1UL
#define RCC_CR_PLLRDY_POS               25UL
#define RCC_CR_PLLRDY_LEN               1UL
#define RCC_CR_PLLSAI1ON_POS            26UL
#define RCC_CR_PLLSAI1ON_LEN            1UL
#define RCC_CR_PLLSAI1RDY_POS           27UL
#define RCC_CR_PLLSAI1RDY_LEN           1UL
#define RCC_CR_PLLSAI2ON_POS            28UL
#define RCC_CR_PLLSAI2ON_LEN            1UL
#define RCC_CR_PLLSAI2RDY_POS           29UL
#define RCC_CR_PLLSAI2RDY_LEN           1UL

#define RCC_ICSCR                       REGISTER(0x40021004UL)
#define RCC_ICSCR_MSICAL_POS            0UL
#define RCC_ICSCR_MSICAL_LEN            8UL
#define RCC_ICSCR_MSITRIM_POS           8UL
#define RCC_ICSCR_MSITRIM_LEN           8UL
#define RCC_ICSCR_HSICAL_POS            16UL
#define RCC_ICSCR_HSICAL_LEN            8UL
#define RCC_ICSCR_HSITRIM_POS           24UL
#define RCC_ICSCR_HSITRIM_LEN           7UL

#define RCC_CFGR                        REGISTER(0x40021008UL)
#define RCC_CFGR_SW_POS                 0UL
#define RCC_CFGR_SW_LEN                 2UL
#define RCC_CFGR_SWS_POS                2UL
#define RCC_CFGR_SWS_LEN                2UL
#define RCC_CFGR_HPRE_POS               4UL
#define RCC_CFGR_HPRE_LEN               4UL
#define RCC_CFGR_PPRE1_POS              8UL
#define RCC_CFGR_PPRE1_LEN              3UL
#define RCC_CFGR_PPRE2_POS              11UL
#define RCC_CFGR_PPRE2_LEN              3UL
#define RCC_CFGR_STOPWUCK_POS           15UL
#define RCC_CFGR_STOPWUCK_LEN           1UL
#define RCC_CFGR_MCOSEL_POS             24UL
#define RCC_CFGR_MCOSEL_LEN             4UL
#define RCC_CFGR_MCOPRE_POS             28UL
#define RCC_CFGR_MCOPRE_LEN             3UL

#define RCC_PLLCFGR                     REGISTER(0x4002100CUL)
#define RCC_PLLCFGR_PLLSRC_POS          0UL
#define RCC_PLLCFGR_PLLSRC_LEN          2UL
#define RCC_PLLCFGR_PLLM_POS            4UL
#define RCC_PLLCFGR_PLLM_LEN            3UL
#define RCC_PLLCFGR_PLLN_POS            8UL
#define RCC_PLLCFGR_PLLN_LEN            7UL
#define RCC_PLLCFGR_PLLPEN_POS          16UL
#define RCC_PLLCFGR_PLLPEN_LEN          1UL
#define RCC_PLLCFGR_PLLP_POS            17UL
#define RCC_PLLCFGR_PLLP_LEN            1UL
#define RCC_PLLCFGR_PLLQEN_POS          20UL
#define RCC_PLLCFGR_PLLQEN_LEN          1UL
#define RCC_PLLCFGR_PLLQ_POS            21UL
#define RCC_PLLCFGR_PLLQ_LEN            2UL
#define RCC_PLLCFGR_PLLREN_POS          24UL
#define RCC_PLLCFGR_PLLREN_LEN          1UL
#define RCC_PLLCFGR_PLLR_POS            25UL
#define RCC_PLLCFGR_PLLR_LEN            2UL
#define RCC_PLLCFGR_PLLPDIV_POS         2UL
#define RCC_PLLCFGR_PLLPDIV_LEN         5UL

#define RCC_PLLSAI1CFGR                 REGISTER(0x40021010UL)
#define RCC_PLLSAI1CFGR_PLLSAI1N_POS    8UL
#define RCC_PLLSAI1CFGR_PLLSAI1N_LEN    7UL
#define RCC_PLLSAI1CFGR_PLLSAI1PEN_POS  16UL
#define RCC_PLLSAI1CFGR_PLLSAI1PEN_LEN  1UL
#define RCC_PLLSAI1CFGR_PLLSAI1P_POS    17UL
#define RCC_PLLSAI1CFGR_PLLSAI1P_LEN    1UL
#define RCC_PLLSAI1CFGR_PLLSAI1QEN_POS  20UL
#define RCC_PLLSAI1CFGR_PLLSAI1QEN_LEN  1UL
#define RCC_PLLSAI1CFGR_PLLSAI1Q_POS    21UL
#define RCC_PLLSAI1CFGR_PLLSAI1Q_LEN    2UL
#define RCC_PLLSAI1CFGR_PLLSAI1REN_POS  24UL
#define RCC_PLLSAI1CFGR_PLLSAI1REN_LEN  1UL
#define RCC_PLLSAI1CFGR_PLLSAI1R_POS    25UL
#define RCC_PLLSAI1CFGR_PLLSAI1R_LEN    2UL
#define RCC_PLLSAI1CFGR_PLLSAI1PDIV_POS 27UL
#define RCC_PLLSAI1CFGR_PLLSAI1PDIV_LEN 5UL

#define RCC_PLLSAI2CFGR                 REGISTER(0x40021014UL)
#define RCC_PLLSAI2CFGR_PLLSAI2N_POS    8UL
#define RCC_PLLSAI2CFGR_PLLSAI2N_LEN    7UL
#define RCC_PLLSAI2CFGR_PLLSAI2PEN_POS  16UL
#define RCC_PLLSAI2CFGR_PLLSAI2PEN_LEN  1UL
#define RCC_PLLSAI2CFGR_PLLSAI2P_POS    17UL
#define RCC_PLLSAI2CFGR_PLLSAI2P_LEN    1UL
#define RCC_PLLSAI2CFGR_PLLSAI2REN_POS  24UL
#define RCC_PLLSAI2CFGR_PLLSAI2REN_LEN  1UL
#define RCC_PLLSAI2CFGR_PLLSAI2R_POS    25UL
#define RCC_PLLSAI2CFGR_PLLSAI2R_LEN    2UL
#define RCC_PLLSAI2CFGR_PLLSAI2PDIV_POS 27UL
#define RCC_PLLSAI2CFGR_PLLSAI2PDIV_LEN 5UL

#define RCC_CIER                        REGISTER(0x40021018UL)
#define RCC_CIER_LSIRDYIE_POS           0UL
#define RCC_CIER_LSIRDYIE_LEN           1UL
#define RCC_CIER_LSERDYIE_POS           1UL
#define RCC_CIER_LSERDYIE_LEN           1UL
#define RCC_CIER_MSIRDYIE_POS           2UL
#define RCC_CIER_MSIRDYIE_LEN           1UL
#define RCC_CIER_HSIRDYIE_POS           3UL
#define RCC_CIER_HSIRDYIE_LEN           1UL
#define RCC_CIER_HSERDYIE_POS           4UL
#define RCC_CIER_HSERDYIE_LEN           1UL
#define RCC_CIER_PLLRDYIE_POS           5UL
#define RCC_CIER_PLLRDYIE_LEN           1UL
#define RCC_CIER_PLLSAI1RDYIE_POS       6UL
#define RCC_CIER_PLLSAI1RDYIE_LEN       1UL
#define RCC_CIER_PLLSAI2RDYIE_POS       7UL
#define RCC_CIER_PLLSAI2RDYIE_LEN       1UL
#define RCC_CIER_LSECSSIE_POS           9UL
#define RCC_CIER_LSECSSIE_LEN           1UL
#define RCC_CIER_HSI48RDYIE_POS         10UL
#define RCC_CIER_HSI48RDYIE_LEN         1UL

#define RCC_CIFR                        REGISTER(0x4002101CUL)
#define RCC_CIFR_LSIRDYF_POS            0UL
#define RCC_CIFR_LSIRDYF_LEN            1UL
#define RCC_CIFR_LSERDYF_POS            1UL
#define RCC_CIFR_LSERDYF_LEN            1UL
#define RCC_CIFR_MSIRDYF_POS            2UL
#define RCC_CIFR_MSIRDYF_LEN            1UL
#define RCC_CIFR_HSIRDYF_POS            3UL
#define RCC_CIFR_HSIRDYF_LEN            1UL
#define RCC_CIFR_HSERDYF_POS            4UL
#define RCC_CIFR_HSERDYF_LEN            1UL
#define RCC_CIFR_PLLRDYF_POS            5UL
#define RCC_CIFR_PLLRDYF_LEN            1UL
#define RCC_CIFR_PLLSAI1RDYF_POS        6UL
#define RCC_CIFR_PLLSAI1RDYF_LEN        1UL
#define RCC_CIFR_PLLSAI2RDYF_POS        7UL
#define RCC_CIFR_PLLSAI2RDYF_LEN        1UL
#define RCC_CIFR_CSSF_POS               8UL
#define RCC_CIFR_CSSF_LEN               1UL
#define RCC_CIFR_LSECSSF_POS            9UL
#define RCC_CIFR_LSECSSF_LEN            1UL
#define RCC_CIFR_HSI48RDYF_POS          10UL
#define RCC_CIFR_HSI48RDYF_LEN          1UL

