hoang-phuong/stm32l4-env/drivers/stm32l4/inc/reg_rcc.h
#define RCC_CICR                        REGISTER(0x40021020UL)
#define RCC_CICR_LSIRDYC_POS            0UL
#define RCC_CICR_LSIRDYC_LEN            1UL
#define RCC_CICR_LSERDYC_POS            1UL
#define RCC_CICR_LSERDYC_LEN            1UL
#define RCC_CICR_MSIRDYC_POS            2UL
#define RCC_CICR_MSIRDYC_LEN            1UL
#define RCC_CICR_HSIRDYC_POS            3UL
#define RCC_CICR_HSIRDYC_LEN            1UL
#define RCC_CICR_HSERDYC_POS            4UL
#define RCC_CICR_HSERDYC_LEN            1UL
#define RCC_CICR_PLLRDYC_POS            5UL
#define RCC_CICR_PLLRDYC_LEN            1UL
#define RCC_CICR_PLLSAI1RDYC_POS        6UL
#define RCC_CICR_PLLSAI1RDYC_LEN        1UL
#define RCC_CICR_PLLSAI2RDYC_POS        7UL
#define RCC_CICR_PLLSAI2RDYC_LEN        1UL
#define RCC_CICR_CSSC_POS               8UL
#define RCC_CICR_CSSC_LEN               1UL
#define RCC_CICR_LSECSSC_POS            9UL
#define RCC_CICR_LSECSSC_LEN            1UL
#define RCC_CICR_HSI48RDYC_POS          10UL
#define RCC_CICR_HSI48RDYC_LEN          1UL

#define RCC_AHB1RSTR                    REGISTER(0x40021028UL)
#define RCC_AHB1RSTR_DMA1RST_POS        0UL
#define RCC_AHB1RSTR_DMA1RST_LEN        1UL
#define RCC_AHB1RSTR_DMA2RST_POS        1UL
#define RCC_AHB1RSTR_DMA2RST_LEN        1UL
#define RCC_AHB1RSTR_FLASHRST_POS       8UL
#define RCC_AHB1RSTR_FLASHRST_LEN       1UL
#define RCC_AHB1RSTR_CRCRST_POS         12UL
#define RCC_AHB1RSTR_CRCRST_LEN         1UL
#define RCC_AHB1RSTR_TSCRST_POS         16UL
#define RCC_AHB1RSTR_TSCRST_LEN         1UL
#define RCC_AHB1RSTR_DMA2DRST_POS       17UL
#define RCC_AHB1RSTR_DMA2DRST_LEN       1UL

#define RCC_AHB2RSTR                    REGISTER(0x4002102CUL)
#define RCC_AHB2RSTR_GPIOARST_POS       0UL
#define RCC_AHB2RSTR_GPIOARST_LEN       1UL
#define RCC_AHB2RSTR_GPIOBRST_POS       1UL
#define RCC_AHB2RSTR_GPIOBRST_LEN       1UL
#define RCC_AHB2RSTR_GPIOCRST_POS       2UL
#define RCC_AHB2RSTR_GPIOCRST_LEN       1UL
#define RCC_AHB2RSTR_GPIODRST_POS       3UL
#define RCC_AHB2RSTR_GPIODRST_LEN       1UL
#define RCC_AHB2RSTR_GPIOERST_POS       4UL
#define RCC_AHB2RSTR_GPIOERST_LEN       1UL
#define RCC_AHB2RSTR_GPIOFRST_POS       5UL
#define RCC_AHB2RSTR_GPIOFRST_LEN       1UL
#define RCC_AHB2RSTR_GPIOGRST_POS       6UL
#define RCC_AHB2RSTR_GPIOGRST_LEN       1UL
#define RCC_AHB2RSTR_GPIOHRST_POS       7UL
#define RCC_AHB2RSTR_GPIOHRST_LEN       1UL
#define RCC_AHB2RSTR_GPIOIRST_POS       8UL
#define RCC_AHB2RSTR_GPIOIRST_LEN       1UL
#define RCC_AHB2RSTR_OTGFSRST_POS       12UL
#define RCC_AHB2RSTR_OTGFSRST_LEN       1UL
#define RCC_AHB2RSTR_ADCRST_POS         13UL
#define RCC_AHB2RSTR_ADCRST_LEN         1UL
#define RCC_AHB2RSTR_DCMIRST_POS        14UL
#define RCC_AHB2RSTR_DCMIRST_LEN        1UL
#define RCC_AHB2RSTR_AESRST_POS         16UL
#define RCC_AHB2RSTR_AESRST_LEN         1UL
#define RCC_AHB2RSTR_HASHRST_POS        17UL
#define RCC_AHB2RSTR_HASHRST_LEN        1UL
#define RCC_AHB2RSTR_RNGRST_POS         18UL
#define RCC_AHB2RSTR_RNGRST_LEN         1UL

#define RCC_AHB3RSTR                    REGISTER(0x40021030UL)
#define RCC_AHB3RSTR_FMCRST_POS         0UL
#define RCC_AHB3RSTR_FMCRST_LEN         1UL
#define RCC_AHB3RSTR_QSPIRST_POS        8UL
#define RCC_AHB3RSTR_QSPIRST_LEN        1UL

#define RCC_APB1RSTR1                   REGISTER(0x40021038UL)
#define RCC_APB1RSTR1_TIM2RST_POS       0UL
#define RCC_APB1RSTR1_TIM2RST_LEN       1UL
#define RCC_APB1RSTR1_TIM3RST_POS       1UL
#define RCC_APB1RSTR1_TIM3RST_LEN       1UL
#define RCC_APB1RSTR1_TIM4RST_POS       2UL
#define RCC_APB1RSTR1_TIM4RST_LEN       1UL
#define RCC_APB1RSTR1_TIM5RST_POS       3UL
#define RCC_APB1RSTR1_TIM5RST_LEN       1UL
#define RCC_APB1RSTR1_TIM6RST_POS       4UL
#define RCC_APB1RSTR1_TIM6RST_LEN       1UL
#define RCC_APB1RSTR1_TIM7RST_POS       5UL
#define RCC_APB1RSTR1_TIM7RST_LEN       1UL
#define RCC_APB1RSTR1_LCDRST_POS        9UL
#define RCC_APB1RSTR1_LCDRST_LEN        1UL
#define RCC_APB1RSTR1_SPI2RST_POS       14UL
#define RCC_APB1RSTR1_SPI2RST_LEN       1UL
#define RCC_APB1RSTR1_SPI3RST_POS       15UL
#define RCC_APB1RSTR1_SPI3RST_LEN       1UL
#define RCC_APB1RSTR1_USART2RST_POS     17UL
#define RCC_APB1RSTR1_USART2RST_LEN     1UL
#define RCC_APB1RSTR1_USART3RST_POS     18UL
#define RCC_APB1RSTR1_USART3RST_LEN     1UL
#define RCC_APB1RSTR1_UART4RST_POS      19UL
#define RCC_APB1RSTR1_UART4RST_LEN      1UL
#define RCC_APB1RSTR1_UART5RST_POS      20UL
#define RCC_APB1RSTR1_UART5RST_LEN      1UL
#define RCC_APB1RSTR1_I2C1RST_POS       21UL
#define RCC_APB1RSTR1_I2C1RST_LEN       1UL
#define RCC_APB1RSTR1_I2C2RST_POS       22UL
#define RCC_APB1RSTR1_I2C2RST_LEN       1UL
#define RCC_APB1RSTR1_I2C3RST_POS       23UL
#define RCC_APB1RSTR1_I2C3RST_LEN       1UL
#define RCC_APB1RSTR1_CRSRST_POS        24UL
#define RCC_APB1RSTR1_CRSRST_LEN        1UL
#define RCC_APB1RSTR1_CAN1RST_POS       25UL
#define RCC_APB1RSTR1_CAN1RST_LEN       1UL
#define RCC_APB1RSTR1_CAN2RST_POS       26UL
#define RCC_APB1RSTR1_CAN2RST_LEN       1UL
#define RCC_APB1RSTR1_PWRRST_POS        28UL
#define RCC_APB1RSTR1_PWRRST_LEN        1UL
#define RCC_APB1RSTR1_DAC1RST_POS       29UL
#define RCC_APB1RSTR1_DAC1RST_LEN       1UL
#define RCC_APB1RSTR1_OPAMPRST_POS      30UL
#define RCC_APB1RSTR1_OPAMPRST_LEN      1UL
#define RCC_APB1RSTR1_LPTIM1RST_POS     31UL
#define RCC_APB1RSTR1_LPTIM1RST_LEN     1UL

#define RCC_APB1RSTR2                   REGISTER(0x4002103CUL)
#define RCC_APB1RSTR2_LPUART1RST_POS    0UL
#define RCC_APB1RSTR2_LPUART1RST_LEN    1UL
#define RCC_APB1RSTR2_I2C4RST_POS       1UL
#define RCC_APB1RSTR2_I2C4RST_LEN       1UL
#define RCC_APB1RSTR2_SWPMI1RST_POS     2UL
#define RCC_APB1RSTR2_SWPMI1RST_LEN     1UL
#define RCC_APB1RSTR2_LPTIM2RST_POS     5UL
#define RCC_APB1RSTR2_LPTIM2RST_LEN     1UL

#define RCC_APB2RSTR                    REGISTER(0x40021040UL)
#define RCC_APB2RSTR_SYSCFGRST_POS      0UL
#define RCC_APB2RSTR_SYSCFGRST_LEN      1UL
#define RCC_APB2RSTR_SDMMC1RST_POS      10UL
#define RCC_APB2RSTR_SDMMC1RST_LEN      1UL
#define RCC_APB2RSTR_TIM1RST_POS        11UL
#define RCC_APB2RSTR_TIM1RST_LEN        1UL
#define RCC_APB2RSTR_SPI1RST_POS        12UL
#define RCC_APB2RSTR_SPI1RST_LEN        1UL
#define RCC_APB2RSTR_TIM8RST_POS        13UL
#define RCC_APB2RSTR_TIM8RST_LEN        1UL
#define RCC_APB2RSTR_USART1RST_POS      14UL
#define RCC_APB2RSTR_USART1RST_LEN      1UL
#define RCC_APB2RSTR_TIM15RST_POS       16UL
#define RCC_APB2RSTR_TIM15RST_LEN       1UL
#define RCC_APB2RSTR_TIM16RST_POS       17UL
#define RCC_APB2RSTR_TIM16RST_LEN       1UL
#define RCC_APB2RSTR_TIM17RST_POS       18UL
#define RCC_APB2RSTR_TIM17RST_LEN       1UL
#define RCC_APB2RSTR_SAI1RST_POS        21UL
#define RCC_APB2RSTR_SAI1RST_LEN        1UL
#define RCC_APB2RSTR_SAI2RST_POS        22UL
#define RCC_APB2RSTR_SAI2RST_LEN        1UL
#define RCC_APB2RSTR_DSFDM1RST_POS      24UL
#define RCC_APB2RSTR_DSFDM1RST_LEN      1UL

#define RCC_AHB1ENR                     REGISTER(0x40021048UL)
#define RCC_AHB1ENR_DMA1EN_POS          0UL
#define RCC_AHB1ENR_DMA1EN_LEN          1UL
#define RCC_AHB1ENR_DMA2EN_POS          1UL
#define RCC_AHB1ENR_DMA2EN_LEN          1UL
#define RCC_AHB1ENR_FLASHEN_POS         8UL
#define RCC_AHB1ENR_FLASHEN_LEN         1UL
#define RCC_AHB1ENR_CRCEN_POS           12UL
#define RCC_AHB1ENR_CRCEN_LEN           1UL
#define RCC_AHB1ENR_TSCEN_POS           16UL
#define RCC_AHB1ENR_TSCEN_LEN           1UL
#define RCC_AHB1ENR_DMA2DEN_POS         17UL
#define RCC_AHB1ENR_DMA2DEN_LEN         1UL

#define RCC_AHB2ENR                     REGISTER(0x4002104CUL)
#define RCC_AHB2ENR_GPIOAEN_POS         0UL
#define RCC_AHB2ENR_GPIOAEN_LEN         1UL
#define RCC_AHB2ENR_GPIOBEN_POS         1UL
#define RCC_AHB2ENR_GPIOBEN_LEN         1UL
#define RCC_AHB2ENR_GPIOCEN_POS         2UL
#define RCC_AHB2ENR_GPIOCEN_LEN         1UL
#define RCC_AHB2ENR_GPIODEN_POS         3UL
#define RCC_AHB2ENR_GPIODEN_LEN         1UL
#define RCC_AHB2ENR_GPIOEEN_POS         4UL
#define RCC_AHB2ENR_GPIOEEN_LEN         1UL
#define RCC_AHB2ENR_GPIOFEN_POS         5UL
#define RCC_AHB2ENR_GPIOFEN_LEN         1UL
#define RCC_AHB2ENR_GPIOGEN_POS         6UL
#define RCC_AHB2ENR_GPIOGEN_LEN         1UL
#define RCC_AHB2ENR_GPIOHEN_POS         7UL
#define RCC_AHB2ENR_GPIOHEN_LEN         1UL
#define RCC_AHB2ENR_GPIOIEN_POS         8UL
#define RCC_AHB2ENR_GPIOIEN_LEN         1UL
#define RCC_AHB2ENR_OTGFSEN_POS         12UL
#define RCC_AHB2ENR_OTGFSEN_LEN         1UL
#define RCC_AHB2ENR_ADCEN_POS           13UL
#define RCC_AHB2ENR_ADCEN_LEN           1UL
#define RCC_AHB2ENR_DCMIEN_POS          14UL
#define RCC_AHB2ENR_DCMIEN_LEN          1UL
#define RCC_AHB2ENR_AESEN_POS           16UL
#define RCC_AHB2ENR_AESEN_LEN           1UL
#define RCC_AHB2ENR_HASHEN_POS          17UL
#define RCC_AHB2ENR_HASHEN_LEN          1UL
#define RCC_AHB2ENR_RNGEN_POS           18UL
#define RCC_AHB2ENR_RNGEN_LEN           1UL

