hoang-phuong/stm32l4-env/drivers/stm32l4/inc/reg_rcc.h
#define RCC_AHB3ENR                     REGISTER(0x40021050UL)
#define RCC_AHB3ENR_FMCEN_POS           0UL
#define RCC_AHB3ENR_FMCEN_LEN           1UL
#define RCC_AHB3ENR_QSPIEN_POS          8UL
#define RCC_AHB3ENR_QSPIEN_LEN          1UL

#define RCC_APB1ENR1                    REGISTER(0x40021058UL)
#define RCC_APB1ENR1_TIM2EN_POS         0UL
#define RCC_APB1ENR1_TIM2EN_LEN         1UL
#define RCC_APB1ENR1_TIM3EN_POS         1UL
#define RCC_APB1ENR1_TIM3EN_LEN         1UL
#define RCC_APB1ENR1_TIM4EN_POS         2UL
#define RCC_APB1ENR1_TIM4EN_LEN         1UL
#define RCC_APB1ENR1_TIM5EN_POS         3UL
#define RCC_APB1ENR1_TIM5EN_LEN         1UL
#define RCC_APB1ENR1_TIM6EN_POS         4UL
#define RCC_APB1ENR1_TIM6EN_LEN         1UL
#define RCC_APB1ENR1_TIM7EN_POS         5UL
#define RCC_APB1ENR1_TIM7EN_LEN         1UL
#define RCC_APB1ENR1_LCDEN_POS          9UL
#define RCC_APB1ENR1_LCDEN_LEN          1UL
#define RCC_APB1ENR1_RTCAPBEN_POS       10UL
#define RCC_APB1ENR1_RTCAPBEN_LEN       1UL
#define RCC_APB1ENR1_WWDGEN_POS         11UL
#define RCC_APB1ENR1_WWDGEN_LEN         1UL
#define RCC_APB1ENR1_SPI2EN_POS         14UL
#define RCC_APB1ENR1_SPI2EN_LEN         1UL
#define RCC_APB1ENR1_SPI3EN_POS         15UL
#define RCC_APB1ENR1_SPI3EN_LEN         1UL
#define RCC_APB1ENR1_USART2EN_POS       17UL
#define RCC_APB1ENR1_USART2EN_LEN       1UL
#define RCC_APB1ENR1_USART3EN_POS       18UL
#define RCC_APB1ENR1_USART3EN_LEN       1UL
#define RCC_APB1ENR1_UART4EN_POS        19UL
#define RCC_APB1ENR1_UART4EN_LEN        1UL
#define RCC_APB1ENR1_UART5EN_POS        20UL
#define RCC_APB1ENR1_UART5EN_LEN        1UL
#define RCC_APB1ENR1_I2C1EN_POS         21UL
#define RCC_APB1ENR1_I2C1EN_LEN         1UL
#define RCC_APB1ENR1_I2C2EN_POS         22UL
#define RCC_APB1ENR1_I2C2EN_LEN         1UL
#define RCC_APB1ENR1_I2C3EN_POS         23UL
#define RCC_APB1ENR1_I2C3EN_LEN         1UL
#define RCC_APB1ENR1_CRSEN_POS          24UL
#define RCC_APB1ENR1_CRSEN_LEN          1UL
#define RCC_APB1ENR1_CAN1EN_POS         25UL
#define RCC_APB1ENR1_CAN1EN_LEN         1UL
#define RCC_APB1ENR1_USBFSENCAN2EN_POS  26UL
#define RCC_APB1ENR1_USBFSENCAN2EN_LEN  1UL
#define RCC_APB1ENR1_PWREN_POS          28UL
#define RCC_APB1ENR1_PWREN_LEN          1UL
#define RCC_APB1ENR1_DAC1EN_POS         29UL
#define RCC_APB1ENR1_DAC1EN_LEN         1UL
#define RCC_APB1ENR1_OPAMPEN_POS        30UL
#define RCC_APB1ENR1_OPAMPEN_LEN        1UL
#define RCC_APB1ENR1_LPTIM1EN_POS       31UL
#define RCC_APB1ENR1_LPTIM1EN_LEN       1UL

#define RCC_APB1ENR2                    REGISTER(0x4002105CUL)
#define RCC_APB1ENR2_LPUART1EN_POS      0UL
#define RCC_APB1ENR2_LPUART1EN_LEN      1UL
#define RCC_APB1ENR2_I2C4EN_POS         1UL
#define RCC_APB1ENR2_I2C4EN_LEN         1UL
#define RCC_APB1ENR2_SWPMI1EN_POS       2UL
#define RCC_APB1ENR2_SWPMI1EN_LEN       1UL
#define RCC_APB1ENR2_LPTIM2EN_POS       5UL
#define RCC_APB1ENR2_LPTIM2EN_LEN       1UL

#define RCC_APB2ENR                     REGISTER(0x40021060UL)
#define RCC_APB2ENR_SYSCFGEN_POS        0UL
#define RCC_APB2ENR_SYSCFGEN_LEN        1UL
#define RCC_APB2ENR_FWEN_POS            7UL
#define RCC_APB2ENR_FWEN_LEN            1UL
#define RCC_APB2ENR_SDMMC1EN_POS        10UL
#define RCC_APB2ENR_SDMMC1EN_LEN        1UL
#define RCC_APB2ENR_TIM1EN_POS          11UL
#define RCC_APB2ENR_TIM1EN_LEN          1UL
#define RCC_APB2ENR_SPI1EN_POS          12UL
#define RCC_APB2ENR_SPI1EN_LEN          1UL
#define RCC_APB2ENR_TIM8EN_POS          13UL
#define RCC_APB2ENR_TIM8EN_LEN          1UL
#define RCC_APB2ENR_USART1EN_POS        14UL
#define RCC_APB2ENR_USART1EN_LEN        1UL
#define RCC_APB2ENR_TIM15EN_POS         16UL
#define RCC_APB2ENR_TIM15EN_LEN         1UL
#define RCC_APB2ENR_TIM16EN_POS         17UL
#define RCC_APB2ENR_TIM16EN_LEN         1UL
#define RCC_APB2ENR_TIM17EN_POS         18UL
#define RCC_APB2ENR_TIM17EN_LEN         1UL
#define RCC_APB2ENR_SAI1EN_POS          21UL
#define RCC_APB2ENR_SAI1EN_LEN          1UL
#define RCC_APB2ENR_SAI2EN_POS          22UL
#define RCC_APB2ENR_SAI2EN_LEN          1UL
#define RCC_APB2ENR_DSFDM1EN_POS        24UL
#define RCC_APB2ENR_DSFDM1EN_LEN        1UL

#define RCC_AHB1SMENR                   REGISTER(0x40021068UL)
#define RCC_AHB1SMENR_DMA1SMEN_POS      0UL
#define RCC_AHB1SMENR_DMA1SMEN_LEN      1UL
#define RCC_AHB1SMENR_DMA2SMEN_POS      1UL
#define RCC_AHB1SMENR_DMA2SMEN_LEN      1UL
#define RCC_AHB1SMENR_FLASHSMEN_POS     8UL
#define RCC_AHB1SMENR_FLASHSMEN_LEN     1UL
#define RCC_AHB1SMENR_SRAM1SMEN_POS     9UL
#define RCC_AHB1SMENR_SRAM1SMEN_LEN     1UL
#define RCC_AHB1SMENR_CRCSMEN_POS       12UL
#define RCC_AHB1SMENR_CRCSMEN_LEN       1UL
#define RCC_AHB1SMENR_TSCSMEN_POS       16UL
#define RCC_AHB1SMENR_TSCSMEN_LEN       1UL
#define RCC_AHB1SMENR_DMA2DSMEN_POS     17UL
#define RCC_AHB1SMENR_DMA2DSMEN_LEN     1UL

#define RCC_AHB2SMENR                   REGISTER(0x4002106CUL)
#define RCC_AHB2SMENR_GPIOASMEN_POS     0UL
#define RCC_AHB2SMENR_GPIOASMEN_LEN     1UL
#define RCC_AHB2SMENR_GPIOBSMEN_POS     1UL
#define RCC_AHB2SMENR_GPIOBSMEN_LEN     1UL
#define RCC_AHB2SMENR_GPIOCSMEN_POS     2UL
#define RCC_AHB2SMENR_GPIOCSMEN_LEN     1UL
#define RCC_AHB2SMENR_GPIODSMEN_POS     3UL
#define RCC_AHB2SMENR_GPIODSMEN_LEN     1UL
#define RCC_AHB2SMENR_GPIOESMEN_POS     4UL
#define RCC_AHB2SMENR_GPIOESMEN_LEN     1UL
#define RCC_AHB2SMENR_GPIOFSMEN_POS     5UL
#define RCC_AHB2SMENR_GPIOFSMEN_LEN     1UL
#define RCC_AHB2SMENR_GPIOGSMEN_POS     6UL
#define RCC_AHB2SMENR_GPIOGSMEN_LEN     1UL
#define RCC_AHB2SMENR_GPIOHSMEN_POS     7UL
#define RCC_AHB2SMENR_GPIOHSMEN_LEN     1UL
#define RCC_AHB2SMENR_GPIOISMEN_POS     8UL
#define RCC_AHB2SMENR_GPIOISMEN_LEN     1UL
#define RCC_AHB2SMENR_SRAM2SMEN_POS     9UL
#define RCC_AHB2SMENR_SRAM2SMEN_LEN     1UL
#define RCC_AHB2SMENR_OTGFSSMEN_POS     12UL
#define RCC_AHB2SMENR_OTGFSSMEN_LEN     1UL
#define RCC_AHB2SMENR_ADCSMEN_POS       13UL
#define RCC_AHB2SMENR_ADCSMEN_LEN       1UL
#define RCC_AHB2SMENR_DCMISMEN_POS      14UL
#define RCC_AHB2SMENR_DCMISMEN_LEN      1UL
#define RCC_AHB2SMENR_AESSMEN_POS       16UL
#define RCC_AHB2SMENR_AESSMEN_LEN       1UL
#define RCC_AHB2SMENR_HASHSMEN_POS      17UL
#define RCC_AHB2SMENR_HASHSMEN_LEN      1UL
#define RCC_AHB2SMENR_RNGSMEN_POS       18UL
#define RCC_AHB2SMENR_RNGSMEN_LEN       1UL

#define RCC_AHB3SMENR                   REGISTER(0x40021070UL)
#define RCC_AHB3SMENR_FMCSMEN_POS       0UL
#define RCC_AHB3SMENR_FMCSMEN_LEN       1UL
#define RCC_AHB3SMENR_QSPISMEN_POS      8UL
#define RCC_AHB3SMENR_QSPISMEN_LEN      1UL

#define RCC_APB1SMENR1                  REGISTER(0x40021078UL)
#define RCC_APB1SMENR1_TIM2SMEN_POS     0UL
#define RCC_APB1SMENR1_TIM2SMEN_LEN     1UL
#define RCC_APB1SMENR1_TIM3SMEN_POS     1UL
#define RCC_APB1SMENR1_TIM3SMEN_LEN     1UL
#define RCC_APB1SMENR1_TIM4SMEN_POS     2UL
#define RCC_APB1SMENR1_TIM4SMEN_LEN     1UL
#define RCC_APB1SMENR1_TIM5SMEN_POS     3UL
#define RCC_APB1SMENR1_TIM5SMEN_LEN     1UL
#define RCC_APB1SMENR1_TIM6SMEN_POS     4UL
#define RCC_APB1SMENR1_TIM6SMEN_LEN     1UL
#define RCC_APB1SMENR1_TIM7SMEN_POS     5UL
#define RCC_APB1SMENR1_TIM7SMEN_LEN     1UL
#define RCC_APB1SMENR1_LCDSMEN_POS      9UL
#define RCC_APB1SMENR1_LCDSMEN_LEN      1UL
#define RCC_APB1SMENR1_WWDGSMEN_POS     11UL
#define RCC_APB1SMENR1_WWDGSMEN_LEN     1UL
#define RCC_APB1SMENR1_SPI2SMEN_POS     14UL
#define RCC_APB1SMENR1_SPI2SMEN_LEN     1UL
#define RCC_APB1SMENR1_SPI3SMEN_POS     15UL
#define RCC_APB1SMENR1_SPI3SMEN_LEN     1UL
#define RCC_APB1SMENR1_USART2SMEN_POS   17UL
#define RCC_APB1SMENR1_USART2SMEN_LEN   1UL
#define RCC_APB1SMENR1_USART3SMEN_POS   18UL
#define RCC_APB1SMENR1_USART3SMEN_LEN   1UL
#define RCC_APB1SMENR1_UART4SMEN_POS    19UL
#define RCC_APB1SMENR1_UART4SMEN_LEN    1UL
#define RCC_APB1SMENR1_UART5SMEN_POS    20UL
#define RCC_APB1SMENR1_UART5SMEN_LEN    1UL
#define RCC_APB1SMENR1_I2C1SMEN_POS     21UL
#define RCC_APB1SMENR1_I2C1SMEN_LEN     1UL
#define RCC_APB1SMENR1_I2C2SMEN_POS     22UL
#define RCC_APB1SMENR1_I2C2SMEN_LEN     1UL
#define RCC_APB1SMENR1_I2C3SMEN_POS     23UL
#define RCC_APB1SMENR1_I2C3SMEN_LEN     1UL
#define RCC_APB1SMENR1_CRSSMEN_POS      24UL
#define RCC_APB1SMENR1_CRSSMEN_LEN      1UL
#define RCC_APB1SMENR1_CAN1SMEN_POS     25UL
#define RCC_APB1SMENR1_CAN1SMEN_LEN     1UL
#define RCC_APB1SMENR1_CAN2SMEN_POS     26UL
#define RCC_APB1SMENR1_CAN2SMEN_LEN     1UL
#define RCC_APB1SMENR1_PWRSMEN_POS      28UL
#define RCC_APB1SMENR1_PWRSMEN_LEN      1UL
#define RCC_APB1SMENR1_DAC1SMEN_POS     29UL
#define RCC_APB1SMENR1_DAC1SMEN_LEN     1UL
#define RCC_APB1SMENR1_OPAMPSMEN_POS    30UL
#define RCC_APB1SMENR1_OPAMPSMEN_LEN    1UL
#define RCC_APB1SMENR1_LPTIM1SMEN_POS   31UL
#define RCC_APB1SMENR1_LPTIM1SMEN_LEN   1UL

#define RCC_APB1SMENR2                  REGISTER(0x4002107CUL)
#define RCC_APB1SMENR2_LPUART1SMEN_POS  0UL
#define RCC_APB1SMENR2_LPUART1SMEN_LEN  1UL
#define RCC_APB1SMENR2_I2C4SMEN_POS     1UL
#define RCC_APB1SMENR2_I2C4SMEN_LEN     1UL
#define RCC_APB1SMENR2_SWPMI1SMEN_POS   2UL
#define RCC_APB1SMENR2_SWPMI1SMEN_LEN   1UL
#define RCC_APB1SMENR2_LPTIM2SMEN_POS   5UL
#define RCC_APB1SMENR2_LPTIM2SMEN_LEN   1UL

#define RCC_APB2SMENR                   REGISTER(0x40021080UL)
#define RCC_APB2SMENR_SYSCFGSMEN_POS    0UL
#define RCC_APB2SMENR_SYSCFGSMEN_LEN    1UL
#define RCC_APB2SMENR_SDMMC1SMEN_POS    10UL
#define RCC_APB2SMENR_SDMMC1SMEN_LEN    1UL
#define RCC_APB2SMENR_TIM1SMEN_POS      11UL
#define RCC_APB2SMENR_TIM1SMEN_LEN      1UL
#define RCC_APB2SMENR_SPI1SMEN_POS      12UL
#define RCC_APB2SMENR_SPI1SMEN_LEN      1UL
#define RCC_APB2SMENR_TIM8SMEN_POS      13UL
#define RCC_APB2SMENR_TIM8SMEN_LEN      1UL
#define RCC_APB2SMENR_USART1SMEN_POS    14UL
#define RCC_APB2SMENR_USART1SMEN_LEN    1UL
#define RCC_APB2SMENR_TIM15SMEN_POS     16UL
#define RCC_APB2SMENR_TIM15SMEN_LEN     1UL
#define RCC_APB2SMENR_TIM16SMEN_POS     17UL
#define RCC_APB2SMENR_TIM16SMEN_LEN     1UL
#define RCC_APB2SMENR_TIM17SMEN_POS     18UL
#define RCC_APB2SMENR_TIM17SMEN_LEN     1UL
#define RCC_APB2SMENR_SAI1SMEN_POS      21UL
#define RCC_APB2SMENR_SAI1SMEN_LEN      1UL
#define RCC_APB2SMENR_SAI2SMEN_POS      22UL
#define RCC_APB2SMENR_SAI2SMEN_LEN      1UL
#define RCC_APB2SMENR_DSFDM1SMEN_POS    24UL
#define RCC_APB2SMENR_DSFDM1SMEN_LEN    1UL

