hoang-phuong/stm32l4-env/drivers/stm32l4/inc/reg_rcc.h
#define RCC_CCIPR                       REGISTER(0x40021088UL)
#define RCC_CCIPR_USART1SEL_POS         0UL
#define RCC_CCIPR_USART1SEL_LEN         2UL
#define RCC_CCIPR_USART2SEL_POS         2UL
#define RCC_CCIPR_USART2SEL_LEN         2UL
#define RCC_CCIPR_USART3SEL_POS         4UL
#define RCC_CCIPR_USART3SEL_LEN         2UL
#define RCC_CCIPR_UART4SEL_POS          6UL
#define RCC_CCIPR_UART4SEL_LEN          2UL
#define RCC_CCIPR_UART5SEL_POS          8UL
#define RCC_CCIPR_UART5SEL_LEN          2UL
#define RCC_CCIPR_LPUART1SEL_POS        10UL
#define RCC_CCIPR_LPUART1SEL_LEN        2UL
#define RCC_CCIPR_I2C1SEL_POS           12UL
#define RCC_CCIPR_I2C1SEL_LEN           2UL
#define RCC_CCIPR_I2C2SEL_POS           14UL
#define RCC_CCIPR_I2C2SEL_LEN           2UL
#define RCC_CCIPR_I2C3SEL_POS           16UL
#define RCC_CCIPR_I2C3SEL_LEN           2UL
#define RCC_CCIPR_LPTIM1SEL_POS         18UL
#define RCC_CCIPR_LPTIM1SEL_LEN         2UL
#define RCC_CCIPR_LPTIM2SEL_POS         20UL
#define RCC_CCIPR_LPTIM2SEL_LEN         2UL
#define RCC_CCIPR_SAI1SEL_POS           22UL
#define RCC_CCIPR_SAI1SEL_LEN           2UL
#define RCC_CCIPR_SAI2SEL_POS           24UL
#define RCC_CCIPR_SAI2SEL_LEN           2UL
#define RCC_CCIPR_CLK48SEL_POS          26UL
#define RCC_CCIPR_CLK48SEL_LEN          2UL
#define RCC_CCIPR_ADCSEL_POS            28UL
#define RCC_CCIPR_ADCSEL_LEN            2UL
#define RCC_CCIPR_SWPMI1SEL_POS         30UL
#define RCC_CCIPR_SWPMI1SEL_LEN         1UL
#define RCC_CCIPR_DFSDM1SEL_POS         31UL
#define RCC_CCIPR_DFSDM1SEL_LEN         1UL

#define RCC_BDCR                        REGISTER(0x40021090UL)
#define RCC_BDCR_LSEON_POS              0UL
#define RCC_BDCR_LSEON_LEN              1UL
#define RCC_BDCR_LSERDY_POS             1UL
#define RCC_BDCR_LSERDY_LEN             1UL
#define RCC_BDCR_LSEBYP_POS             2UL
#define RCC_BDCR_LSEBYP_LEN             1UL
#define RCC_BDCR_LSEDRV_POS             3UL
#define RCC_BDCR_LSEDRV_LEN             2UL
#define RCC_BDCR_LSECSSON_POS           5UL
#define RCC_BDCR_LSECSSON_LEN           1UL
#define RCC_BDCR_LSECSSD_POS            6UL
#define RCC_BDCR_LSECSSD_LEN            1UL
#define RCC_BDCR_RTCSEL_POS             8UL
#define RCC_BDCR_RTCSEL_LEN             2UL
#define RCC_BDCR_RTCEN_POS              15UL
#define RCC_BDCR_RTCEN_LEN              1UL
#define RCC_BDCR_BDRST_POS              16UL
#define RCC_BDCR_BDRST_LEN              1UL
#define RCC_BDCR_LSCOEN_POS             24UL
#define RCC_BDCR_LSCOEN_LEN             1UL
#define RCC_BDCR_LSCOSEL_POS            25UL
#define RCC_BDCR_LSCOSEL_LEN            1UL

#define RCC_CSR                         REGISTER(0x40021094UL)
#define RCC_CSR_LSION_POS               0UL
#define RCC_CSR_LSION_LEN               1UL
#define RCC_CSR_LSIRDY_POS              1UL
#define RCC_CSR_LSIRDY_LEN              1UL
#define RCC_CSR_MSISRANGE_POS           8UL
#define RCC_CSR_MSISRANGE_LEN           4UL
#define RCC_CSR_RMVF_POS                23UL
#define RCC_CSR_RMVF_LEN                1UL
#define RCC_CSR_FIREWALLRSTF_POS        24UL
#define RCC_CSR_FIREWALLRSTF_LEN        1UL
#define RCC_CSR_OBLRSTF_POS             25UL
#define RCC_CSR_OBLRSTF_LEN             1UL
#define RCC_CSR_PINRSTF_POS             26UL
#define RCC_CSR_PINRSTF_LEN             1UL
#define RCC_CSR_BORRSTF_POS             27UL
#define RCC_CSR_BORRSTF_LEN             1UL
#define RCC_CSR_SFTRSTF_POS             28UL
#define RCC_CSR_SFTRSTF_LEN             1UL
#define RCC_CSR_IWDGRSTF_POS            29UL
#define RCC_CSR_IWDGRSTF_LEN            1UL
#define RCC_CSR_WWDGRSTF_POS            30UL
#define RCC_CSR_WWDGRSTF_LEN            1UL
#define RCC_CSR_LPWRRSTF_POS            31UL
#define RCC_CSR_LPWRRSTF_LEN            1UL

#define RCC_CRRCR                       REGISTER(0x40021098UL)
#define RCC_CRRCR_HSI48ON_POS           0UL
#define RCC_CRRCR_HSI48ON_LEN           1UL
#define RCC_CRRCR_HSI48RDY_POS          1UL
#define RCC_CRRCR_HSI48RDY_LEN          1UL
#define RCC_CRRCR_HSI48CAL_POS          7UL
#define RCC_CRRCR_HSI48CAL_LEN          9UL

#define RCC_CCIPR2                      REGISTER(0x4002109CUL)
#define RCC_CCIPR2_I2C4SEL_POS          0UL
#define RCC_CCIPR2_I2C4SEL_LEN          2UL


#endif /* #ifndef _REG_RCC_H_ */
